{"intents": [{"tag": "salam", "patterns": ["Hai", "Hi","Permisi", "Halo", "Selamat Pagi", "Selamat Siang", "Selamat Malam", "Good Morning", "Bro", "Sis", "Kawan"], "responses": ["Halo, ada yang bisa saya bantu?", "Halo, selamat datang", "Hai! Corny di sini, mau tau informasi tentang apa nih?"]}, {"tag": "bye", "patterns": ["Selamat Tinggal", "Dah", "Semoga harimu menyenangkan", "Sampai Jumpa Lagi", "Ok bye",  "Ok Terimakasih", "See You"], "responses": ["See U! Senang Bisa Membantu"]}, {"tag": "nama", "patterns": ["nama kamu siapa?", "namamu siapa?", "siapa sih lo?", "kamu siapa?", "nama?"], "responses": ["Namaku Cornny Bot, salam kenal ya!", "Halo, aku Cornny Bot!", "Kenalin, aku Cornny Bot!"]}, {"tag": "pekerjaan", "patterns": ["pekerjaan kamu apa?", "lu kerja apa?", "tugas kamu apa?", "tugas lo ngapain?"], "responses": ["Aku akan membantu dalam menjawab pertanyaamu tentang seputar penyakit pada tanaman jagung", "Tugasku jadi asisten di Cornny. Silahkan bertanya"]}, {"tag": "tentang_cornny", "patterns": ["cornny itu apa?", "kegunaan cornny itu apa?", "emang cornny apa sih?", "wah apa tuh cornny?", "cornny emang apa?", "cornny itu apa sih"], "responses": [" Cornny adalah produk kami yang berguna untuk mendeteksi penyakit pada tanaman jagung anda serta memberikan sebagian informasi tentang 3 penyakit yang ada pada tanaman jagung."]}, {"tag": "program_cornny", "patterns": ["apa aja sih penyakit pada tanaman jagung?", "penyakitnya apa?", "wah apa saja penyakitnya?", "penyakit tanaman jagung itu apa sih"], "responses": ["Penyakit pada tanaman jagung adalah Corn Northern Leaf Blight, Corn Gray Leaf Spot, dan Corn CommonRust."]}, {"tag": "tentang_penyakit1", "patterns": ["Corn Northern Leaf Blight itu apa?", "penyakit Corn Northern Leaf Blight", "apa itu Corn Northern Leaf Blight", "penjelasan dari Corn Northern Leaf Blight", "Corn Northern Leaf Blight itu apa sih"], "responses": ["Corn Northern Leaf Blight adalah penyakit jamur yang disebabkan oleh patogen Setosphaeria turcica. Gejala penyakitnya meliputi lesi berbentuk cerutu yang berwarna hijau-abu-abu dan mungkin memiliki halo kuning di sekitarnya. Lesi biasanya muncul didaun bagian bawah kemudian menyebar ke daun yang lebih tinggi "]}, {"tag": "tentang_penyakit2", "patterns": ["Corn Gray Leaf Spot itu apa sih", "Penjelasan dari Corn Gray Leaf Spot", "apa itu Corn Gray Leaf Spot", "penyakit Corn Gray Leaf Spot itu apaan sih"], "responses": ["Corn Gray Leaf Spot adalah penyakit yang disebabkan oleh jamur yaitu patogen cercospora zeae-maydis. Gejala nya meliputi lesi kecil berbentuk segi empat dengan pusat abu-abu dan pinggiran coklat tua. Lesi awalnya muncul dibagian bawah daun dahulu"]}, {"tag": "tentang_penyakit3", "patterns": ["corn common rust", "penyakit corn common rust itu apa", "apa itu corn common rust", "penjelasan dari corn common rust", "corn common rust itu apa sih"], "responses": ["corn common rust adalah penyakit yang disebabkan oleh jamur yaitu patogen Puccinia sorghi. Gejala ini meliputi pustula kecil berbentuk lingkaran hingga memanjang berwarna oranye hingga coklat yang berkembang di kedua sisi daun tanaman jagung. Saat pustula matang, mereka menjadi berwarna coklat tua hingga hitam"]},{"tag": "pencegahan_penyakit3", "patterns": ["cara pencegahan corn common rust gimana?", "mengatasi penyakit corn common rust itu seperti apa", "bagaimana mengobati penyakit corn common rust", "langkah langkah untuk mengobati tanaman jagung dari corn common rust", "mengatasi penyakit corn common rust dengan apa?"], "responses": ["Cara pencegahan tanaman jagung dari penyakit corn common rust adalah dengan penggunaan insektisida, segera potong dan buang daun yang terinfeksi, rotasi tanaman apabila kejadian tersebut sering terjadi di lahan yang sama, jika kondisi penyakit parah penggunaan fungisida dapat di perluhkan, selalu menjaga kebersihan kebun agar mengurangi kemungkinan penyebaran penyakit berikutnya, lakukan konsultasi dengan ahli pertanian setempat "]},{"tag": "pencegahan_penyakit2", "patterns": ["cara pencegahan corn gray leaf spot gimana?", "mengatasi penyakit corn gray leaf spot itu seperti apa", "bagaimana mengobati penyakit corn gray leaf spot", "langkah langkah untuk mengobati tanaman jagung dari penyakit corn gray leaf spot", "mengatasi penyakit corn gray leaf spot dengan apa?"], "responses": ["Cara pencegahan tanaman jagung dari penyakit corn gray leaf spot adalah dengan memilih varietas jagung yang memiliki ketahanan alami dari penyakit ini,jaga jarak antar tanaman agar meningkatkan sirkulasi udara, pengairan yang tepat jangan sampai kelebihan air, rotasi tanaman dengan menanam tanaman yang tidak rentan dengan penyakit tersebut, penggunaan pupuk dan nutrisi yang seimbang untuk dosis bisa konsultasi dengan ahli pertanian,jika kondisi penyakit parah penggunaan fungisida dapat di perluhkan, selalu menjaga kebersihan kebun agar mengurangi kemungkinan penyebaran penyakit berikutnya, memantau tanaman secara rutin dan periksa secara teratur "]},{"tag": "pencegahan_penyakit1", "patterns": ["cara pencegahan corn northern leaf blight gimana?", "mengatasi penyakit corn northern leaf blight itu seperti apa", "bagaimana mengobati penyakit corn northern leaf blight", "langkah langkah untuk mengobati tanaman jagung dari corn northern leaf blight", "mengatasi penyakit corn northern leaf blight dengan apa?"], "responses": ["Cara pencegahan tanaman jagung dari penyakit corn northern leaf blight adalah cari varietas yang memiliki ketahanan terhadap penyakit tersebut, rotasi tanaman dengan menanam tanaman yang tidak rentan dengan penyakit tersebut, , jaga kebersihan lahan dan tanaman, jaga jarak antar tanaman, pengairan yang tepat,penggunaan pupuk dan nutrisi yang seimbang, Memantau tanaman secara rutin dan apabila kondisi parah dapat menggunakan fungisida"]}]}
